slash-tzf/ESP32_MQTT/main/http_server/modem_http_config.c
    char *chunk = rest_context->scratch;
    ssize_t read_bytes;
    do {
        /* Read file in chunks into the scratch buffer */
        read_bytes = read(fd, chunk, SCRATCH_BUFSIZE);
        if (read_bytes == -1) {
            ESP_LOGE(TAG, "Failed to read file : %s", filepath);
        } else if (read_bytes > 0) {
            /* Send the buffer contents as HTTP response chunk */
            if (httpd_resp_send_chunk(req, chunk, read_bytes) != ESP_OK) {
                close(fd);
                ESP_LOGE(TAG, "File sending failed!");
                /* Abort sending file */
                httpd_resp_sendstr_chunk(req, NULL);
                /* Respond with 500 Internal Server Error */
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to send file");
                return ESP_FAIL;
            }
        }
    } while (read_bytes > 0);
    /* Close file after sending complete */
    close(fd);
    ESP_LOGD(TAG, "File sending complete");
    /* Respond with an empty chunk to signal HTTP response completion */
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
end:
    return ESP_OK;
}

static esp_err_t sensors_data_get_handler(httpd_req_t *req)
{
    char *json_str = NULL;
    size_t size = 0;
    
    // 获取最新的数据模型
    data_model_t *model = data_model_get_latest();
    if (model == NULL) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No sensor data available");
        return ESP_FAIL;
    }
    
    // 构建JSON响应
    size = asprintf(&json_str, 
                    "{"
                    "\"temperature\":%.2f,"
                    "\"humidity\":%.2f,"
                    "\"light_intensity\":%.2f,"
                    "\"sensors_valid\":%s,"
                    "\"latitude\":%.6f,"
                    "\"longitude\":%.6f,"
                    "\"ns_indicator\":\"%c\","
                    "\"ew_indicator\":\"%c\","
                    "\"altitude\":%.2f,"
                    "\"speed\":%.2f,"
                    "\"course\":%.2f,"
                    "\"data_source\":%d,"
                    "\"gps_valid\":%s,"
                    "\"timestamp\":%ld"
                    "}",
                    model->sensors.temperature,
                    model->sensors.humidity,
                    model->sensors.light_intensity,
                    model->sensors.sensors_valid ? "true" : "false",
                    model->gps.latitude,
                    model->gps.longitude,
                    model->gps.ns_indicator,
                    model->gps.ew_indicator,
                    model->gps.altitude,
                    model->gps.speed,
                    model->gps.course,
                    model->gps.data_source,
                    model->gps.gps_valid ? "true" : "false",
                    (long)model->timestamp);
    
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "*");
    
    // 设置HTTP状态码
    esp_err_t ret = httpd_resp_set_status(req, HTTPD_200);
    ESP_ERROR_CHECK(ret);
    
    // 设置HTTP内容类型
    ret = httpd_resp_set_type(req, HTTPD_TYPE_JSON);
    ESP_ERROR_CHECK(ret);
    
    // 发送响应
    ret = httpd_resp_send(req, json_str, size);
    ESP_LOGD(TAG, "%s", json_str);
    free(json_str);
    ESP_ERROR_CHECK(ret);
    
    return ESP_OK;
}

static esp_err_t wifi_sta_get_handler(httpd_req_t *req)
{
    // 检查权限
    if (basic_auth_get(req) != ESP_OK) {
        return ESP_FAIL;
    }

    // 重定向到静态HTML文件
    httpd_resp_set_status(req, "302 Found");
    httpd_resp_set_hdr(req, "Location", "/wifi_sta.html");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t wifi_sta_post_handler(httpd_req_t *req)
{
    // 检查权限
    if (basic_auth_get(req) != ESP_OK) {
        return ESP_FAIL;
    }
    
    // 获取POST数据
    char *buf = malloc(1024);
    if (buf == NULL) {
        ESP_LOGE(TAG, "内存分配失败");
        return ESP_FAIL;
    }
    
    int total_len = req->content_len;
    int cur_len = 0;
    int received = 0;
    
    if (total_len >= 1024) {
        ESP_LOGE(TAG, "内容太长");
        free(buf);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "内容太长");
        return ESP_FAIL;
    }
    
    while (cur_len < total_len) {
        received = httpd_req_recv(req, buf + cur_len, total_len - cur_len);
        if (received <= 0) {
            ESP_LOGE(TAG, "接收数据失败");
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "接收数据失败");
            return ESP_FAIL;
        }
        cur_len += received;
    }
    buf[total_len] = '\0';
    
    ESP_LOGI(TAG, "收到的WiFi配置数据: %s", buf);
    
    // 解析SSID和密码
    char ssid[33] = {0};
    char password[65] = {0};
    
    char *ssid_ptr = strstr(buf, "ssid=");
    char *password_ptr = strstr(buf, "password=");
    
    if (ssid_ptr) {
        ssid_ptr += 5; // 跳过 "ssid="
        char *end = strchr(ssid_ptr, '&');
        if (end) {
            strncpy(ssid, ssid_ptr, end - ssid_ptr);
        } else {
            strcpy(ssid, ssid_ptr);
        }
    }
    
    if (password_ptr) {
        password_ptr += 9; // 跳过 "password="
        char *end = strchr(password_ptr, '&');
        if (end) {
            strncpy(password, password_ptr, end - password_ptr);
        } else {
            strcpy(password, password_ptr);
        }
    }
    
    free(buf);
    
    // URL解码
    char decoded_ssid[33] = {0};
    char decoded_password[65] = {0};
    
    url_decode(ssid, decoded_ssid);
    url_decode(password, decoded_password);
    
    ESP_LOGI(TAG, "解析的WiFi配置 - SSID: %s", decoded_ssid);
    
    // 保存配置并尝试连接
    esp_err_t ret = network_manager_set_wifi_config(decoded_ssid, decoded_password);
    
    // 返回JSON结果
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    
    if (ret == ESP_OK) {
        httpd_resp_sendstr(req, "{\"status\":\"success\",\"message\":\"WiFi配置已保存并尝试连接\"}");
    } else {
        httpd_resp_sendstr(req, "{\"status\":\"error\",\"message\":\"保存WiFi配置失败\"}");
    }
    
    return ESP_OK;
}

